const categoriesTitle = `
I категория студентов, которые закрывают производственную практику до начала практики по процедуре перезачёта кредитов в рамках заседания комиссии Университета.

II категория студентов, которые самостоятельно определили место прохождения практики и проходят его согласно академическому календарю (28.06.2021 – 24.07.2021).

III категория студентов, которых направляет университет (определяет место прохождения практики) согласно академическому календарю (28.06.2021 – 24.07.2021).
`;

const firstCategoryText = `
<b>I категория студентов, которые закрывают производственную практику до начала практики по процедуре перезачёта кредитов в рамках заседания комиссии Университета:</b>

Для перезачёта кредитов Вам важно выполнить следующие пункты:

1. Длительность производственной практики (стажировки) должна составлять не менее 8-и недель. Необходимо приложить справку (в свободной форме от предприятия на бланке или с печатью), где будут указаны в какой организации была пройдена стажировка, роль - должность (например, Software Development Intern) и количество затраченных недель;

2. Организация (компания, где Вы прошли стажировку) должна дать Вам характеристику (в свободной форме или согласно образцу), где детально будет показано то, чем Вы занимались во время стажировки (практики) и полученные результаты практики. Данный вид деятельности должен совпадать с Вашей образовательной программой (ОП). В характеристике, компания может предложить оценку, но финальная оценка будет за ответственным преподавателем (руководителем практики от Университета) на основании Вашего отчета и характеристики;

3. Необходимо сформировать (написать) отчёт (пример оформления отчёта вложен) на 1800-2000 слов (на английском языке), где детально будут описаны выполненные Вами проекты (задачи) в рамках прохождения стажировки (практики);

4. Необходимо написать заявление на перезачёт кредитов (образец вложен) от руки и отправить сканированную копию в хорошем качестве;

5. От Университета определены ответственные преподаватели (руководители практик) по направлениям ОП (список преподавателей по группам вложен). Преподаватель по Вашей характеристике от организации (компании) и отчету выдаст на Вас свою характеристику. Руководитель практики от Университета проверит, что вид Вашей деятельности во время стажировки совпадает с Вашей ОП и проверит отчёт. В результате анализа определит уровень освоения результатов обучения - финальная оценка, которая войдёт в транскрипт;

6. Все документы необходимо отправить до 25-го мая на practice@astanait.edu.kz;

7. Координатор образовательной программы проверяет все ли процедуры были соблюдены корректно, визирует со своей стороны, и ходатайствует на комиссию по перезачёту кредитов.
`;

const secondCategoryText = `
<b>II категория студентов, которые самостоятельно определили место прохождения практики и проходят его согласно академическому календарю (28.06.2021 – 24.07.2021):</b>

Важно выполнить следующие пункты:

1. Студент самостоятельно находит объект для прохождения практики и инициирует заключение (оформление) 3-х стороннего договора (Университет – Организация – Студент) и 2-х стороннего договора (Университет – Организация) (образцы договора вложены). Для организационных вопросов по оформлению и заключению договора, можно будет написать на почту practice@astanait.edu.kz.

2. Деканат готовит направление на производственную практику согласно заключенному договору (без участия студентов).

3. Задача студента подготовить и согласовать календарный план-график (образец вложен) прохождения практики от предприятия. Календарный план-график формируется в соответствии с утвержденной формой (образец вложен) с руководителем от предприятия и от Университета на первой неделе практики согласно академ. календарю.

4. На последней неделе практики согласно академ. календарю студент запрашивает у руководителя практики от организации характеристику с указанием выполненных работ (проектов), сроков прохождения практики, описания уровня достигнутых результатов (приобретенных знании, умении и навыков) и предлагаемой оценки;

5. По окончанию практики студент готовит отчёт о выполнении задании практики и выкладывает в систему Moodle включая характеристику (сканированную копию).

6. Руководитель от Университета оценивает достигнутые результаты студента согласно предоставленным отчёту и характеристике от предприятия. Финальная оценка руководителя практики от Университета войдёт в транскрипт студента.
`;

const thirdCategoryText = `
<b>III категория студентов, которых направляет университет (определяет место прохождения практики) согласно академическому календарю (28.06.2021 – 24.07.2021):</b>

Важно выполнить следующие пункты:

1. Деканат готовит направление на производственную практику согласно заключенному договору (без участия студентов).

2. Задача студента подготовить и согласовать календарный план-график (образец вложен) прохождения практики от предприятия. Календарный план-график формируется в соответствии с утвержденной формой (образец вложен) с руководителем от предприятия и от Университета на первой неделе практики согласно академ. календарю.

3. На последней неделе практики согласно академ. календарю студент запрашивает у руководителя практики от организации характеристику с указанием выполненных работ (проектов), сроков прохождения практики, описания уровня достигнутых результатов (приобретенных знании, умении и навыков) и предлагаемой оценки;

4. По окончанию практики студент готовит отчёт о выполнении задании практики и выкладывает в систему Moodle включая характеристику (сканированную копию).

5. Руководитель от Университета оценивает достигнутые результаты студента согласно предоставленным отчёту и характеристике от предприятия. Финальная оценка руководителя практики от Университета войдёт в транскрипт студента.
`;

module.exports = {
  categoriesTitle,
  firstCategoryText,
  secondCategoryText,
  thirdCategoryText,
};
